{
  "profile": {
    "name": "Jason Siegel ",
    "headline": "Managing Partner | Public Speaker | Chief Digital Officer | Creative Director | CMO at Bluetext ☏703-625-3560",
    "location": "Annandale, Virginia",
    "summary": "Jason Siegel is an accomplished agency executive. As Managing Partner, chief marketing officer, and head of the Bluetext creative and digital services group, Jason manages and directs development of a wide range of interactive services for Bluetext clients. He has an exceptional record for great client service with all facets of creative and digital services. Prior to founding Bluetext Jason was a Partner at Qorvis for 8 year. He joined Qorvis after his digital agency Internet Gravity was acquired by Qorvis. Siegel founded his own interactive agency, Internet Gravity, in 1998 grew the company’s clientele exponentially. He has produced, designed and built more than 1000 websites for a variety of businesses and was selected by Yahoo as the nation’s best college web designer of 1998 and was selected twice to the 40 Under 40 by Direct Marketing Association (ages 36 and 38).\n\nSpecialties: Business Development\nLeadership and Management\nBranding\nIntegrated Communications\nDigital Strategy\nInformation Architecture\nDemand Generation",
    "connections": "500+"
  },
  "positions": [
    {
      "title": "Managing Partner | Co-Founder | Chief Digital Officer | Creative Director | CMO",
      "companyName": "Bluetext (Acquired by Eastport Holdings)",
      "description": "Jason is the co-founder of Bluetext. Here he focuses on leading creative, digital and marketing efforts.In his role, he guides creative teams consisting of visual designers, digital strategist, and ux designers, working in close collaboration across disciplines throughout the agency.",
      "date1": "Feb 2011 – Present",
      "date2": "8 yrs 3 mos"
    },
    {
      "title": "President",
      "companyName": "UFollowUp (Acquired by Lasso CRM)",
      "description": "In November 2012 UFollowUp was acquired by Lasso Data Systems. I exited all of my equity in the company in this transaction. Jason Siegel has been the President of UFollowUp since co-founding the company in 2003, and has helped grow UFollowUp from a niche local email marketing company to the nation's leading provider of one-to-one, on-demand mes... ",
      "date1": "Jan 2003 – Nov 2012",
      "date2": "9 yrs 11 mos"
    },
    {
      "title": "Partner / Chief Marketing Officer / Head of Creative and Digital Services",
      "companyName": "Qorvis Communications",
      "description": "In 2004 Siegel merged Internet Gravity, a leading interactive agency with Qorvis, to launch this high growth agency into the exciting areas of creative and interactive services. As Partner and head of the Qorvis creative services group, Siegel manages and directs the design development of a wide range of interactive and branding services for Qorvis clients... ",
      "date1": "2003 – Mar 2011",
      "date2": "8 yrs"
    },
    {
      "title": "Board Member",
      "companyName": "PointAbout Inc.",
      "description": "Active board member until company acquisition.",
      "date1": "Mar 2008 – Mar 2010",
      "date2": "2 yrs 1 mo"
    },
    {
      "title": "CEO",
      "companyName": "Internet Gravity (Acquired by Qorvis)",
      "description": "Yahoo's College Web Designer of the Year for 1998, Jason started an interactive agency out of his college dorm room. Leading new business development, creative direction, and agency operations Jason grew the firm to a top 20 agency in the greater Washington area.",
      "date1": "Aug 1998 – Jun 2004",
      "date2": "5 yrs 11 mos"
    }
  ],
  "educations": [
    {
      "title": "Georgetown University McDonough School of Business",
      "degree": "Graduate Studies",
      "date1": "2009",
      "date2": "2010"
    },
    {
      "title": "Towson University",
      "degree": "Business",
      "date1": "1995",
      "date2": "1999"
    },
    {
      "title": "Northport High School",
      "degree": "Regents Diploma",
      "date1": "1991",
      "date2": "1995"
    }
  ],
  "skills": [
    {
      "title": "Digital Strategy",
      "count": "99+"
    },
    {
      "title": "Digital Marketing",
      "count": "99+"
    },
    {
      "title": "Integrated Marketing",
      "count": "99+"
    },
    {
      "title": "Email Marketing",
      "count": "99+"
    },
    {
      "title": "Advertising",
      "count": "88"
    },
    {
      "title": "Marketing Strategy",
      "count": "72"
    },
    {
      "title": "Web Design",
      "count": "57"
    },
    {
      "title": "User Experience",
      "count": "44"
    },
    {
      "title": "Digital Media",
      "count": "41"
    },
    {
      "title": "Social Media Marketing",
      "count": "38"
    },
    {
      "title": "Social Media",
      "count": "35"
    },
    {
      "title": "Online Advertising",
      "count": "32"
    },
    {
      "title": "Business Development",
      "count": "32"
    },
    {
      "title": "SEO",
      "count": "29"
    },
    {
      "title": "Copywriting",
      "count": "28"
    },
    {
      "title": "User Interface Design",
      "count": "27"
    },
    {
      "title": "Information Architecture",
      "count": "26"
    },
    {
      "title": "Brand Development",
      "count": "26"
    },
    {
      "title": "Web Development",
      "count": "25"
    },
    {
      "title": "Online Marketing",
      "count": "21"
    },
    {
      "title": "New Media",
      "count": "16"
    },
    {
      "title": "Strategic Planning",
      "count": "16"
    },
    {
      "title": "Public Relations",
      "count": "15"
    },
    {
      "title": "Marketing Communications",
      "count": "15"
    },
    {
      "title": "Direct Marketing",
      "count": "12"
    },
    {
      "title": "Creative Strategy",
      "count": "12"
    },
    {
      "title": "Interactive Marketing",
      "count": "11"
    },
    {
      "title": "Corporate Branding",
      "count": "11"
    },
    {
      "title": "Graphic Design",
      "count": "10"
    },
    {
      "title": "Corporate Communications",
      "count": "9"
    },
    {
      "title": "Blogging",
      "count": "7"
    },
    {
      "title": "Mobile Marketing",
      "count": "6"
    },
    {
      "title": "Mobile Devices",
      "count": "6"
    },
    {
      "title": "SEM",
      "count": "5"
    },
    {
      "title": "Media Relations",
      "count": "4"
    },
    {
      "title": "Customer Relations",
      "count": "3"
    },
    {
      "title": "Mobile",
      "count": "1"
    },
    {
      "title": "CMS",
      "count": "11"
    },
    {
      "title": "Wordpress",
      "count": "5"
    },
    {
      "title": "Photoshop",
      "count": "5"
    },
    {
      "title": "Web 2.0",
      "count": "3"
    },
    {
      "title": "Facebook",
      "count": "2"
    },
    {
      "title": "Adobe Creative Suite",
      "count": "2"
    },
    {
      "title": "Customer Service",
      "count": "5"
    },
    {
      "title": "Messaging",
      "count": "2"
    },
    {
      "title": "Creative Direction",
      "count": "58"
    },
    {
      "title": "New Business Development",
      "count": "21"
    },
    {
      "title": "Website Development",
      "count": "20"
    },
    {
      "title": "Social Networking",
      "count": "4"
    },
    {
      "title": "Promotions",
      "count": "1"
    }
  ],
  "recommendations": {
    "givenCount": "20",
    "receivedCount": "15",
    "given": [
      {
        "user": "https://www.linkedin.com/in/charlotte-talis/",
        "text": "Jason was my Creative Director for over a year at Bluetext. When I interviewed for my position he said I would get the equivalent of an MBA in web design and he wasn’t lying. After my time at Bluetext I feel extremely confident in my web design skills and I owe my knowledge to our creative team led by Jason.\nJason values each member of his team and will always listen to new ideas or process improvements. He is constantly looking to improve and frequently asks his team for feedback during team meetings. His door is always open and he makes a point to advocate for his team’s needs.\nI am lucky to have started my career in design under Jason’s leadership and I appreciate and value all of knowledge he has given me. See less"
      },
      {
        "user": "https://www.linkedin.com/in/damienenderle/",
        "text": "I have had the privilege of being both a client and close, personal colleague of Jason for more than eight years. In my more than 20 years of marketing leadership experience in both national advertising agencies and international professional services organizations, I have never come across an individual who possesses Jason’s tri-fecta combination of technical web knowledge, media and design talent, and the ability to speak to clients in any industry, at any level. Put simply, Jason Siegel is a professional powerhouse in today’s constantly-changing digital media world.\n\nIn the past six years, at two different national firms, Jason and his team have supported me and my teams through the scoping, build and launch of three different digital platforms complete with new brand launches, media buys, PR campaigns and full-scale SEO builds. In addition, Jason and Bluetext worked with me and an international consortium of firms, marketers and firm leaders on the rebranding and launch for an international association of accounting firms. Through all of these projects, Jason’s creative vision and ability to communicate the technical and media scope of work were beyond compare. Few, if any, digital marketing and media professionals have Jason’s ability to set a definitive project course that everyone understands and in the end exceeds expectations and is delivered on time and on budget.\n\nHaving hired and worked with many media agencies and PR professionals over the course of my career, it took me some time to analyze how it is that Jason and his team at Bluetext are so successful in consistently delivering beyond what they promise to clients. Eventually I figured it out; Jason approaches every client and every new project with two primary tools: his ears and his eyes. Where other agencies and media professionals lead with a laptop and PowerPoint presentation, Jason brings a keen ability to listen, observe and analyze. And not just on what a client and its leadership team see as needs today, but also what they must consider for the business two or three years in the future. See less"
      },
      {
        "user": "https://www.linkedin.com/in/erikrequidan/",
        "text": "Its easy to understand why Jason is widely recognized as a leader in web design and creative communications. Working with Jason and his team directly - he demonstrated his ability to understand, execute and deliver against our strategic needs..."
      },
      {
        "user": "https://www.linkedin.com/in/maxhancock/",
        "text": "Jason possesses a portfolio of impressive leadership and interaction design skills that are uniquely his own. His balanced, thoughtful leadership never failed to help us through some very challenging projects. I am privileged to have worked with him, and witness and learn from his tactful approach towards business and interaction design. See less"
      },
      {
        "user": "https://www.linkedin.com/in/scolella/",
        "text": "I had the pleasure of working on numerous projects directed by Jason at Qorvis over the last few years. Always expanding on the concept, a fantastic resource from marketing campaigns to motion graphics, the wheels never stop turning. A brilliant idea man, whose conceptual and literal designs provide incredible fuel to any creative development team. It was my job to bring to life the ideas that Jason conceptualized and laid out and he was always wanting to push the envelope. Amazing client relationships, Jason's demeanor was always uplifting, he was great fun and I was ever eager to work on the next one of his concepts. One of the best design partners I have ever collaborated with, with no shortage of continuous creativity. See less"
      },
      {
        "user": "https://www.linkedin.com/in/chaturg/",
        "text": "I worked closely with Jason for over two years on an array of digital campaigns. Jason was incredible - knowledgeable, creative, results-oriented and a great mentor. He was always able to create engaging user experiences by leveraging the latest digital tools. Moreover, he executes his campaigns with a solid underlying business case, a trait that makes him stand out! See less"
      },
      {
        "user": "https://www.linkedin.com/in/lwooster/",
        "text": "The passion and creativity that Jason brings to his role and to clients is unrivaled. He has the ability to completely transform a client's perception of how digital and interactive strategies can benefit its organization - and then transforms that perception into reality with the solutions he and his team deliver. He is on top of the latest marketing and interactive trends and frequently demonstrates how Qorvis and its clients can move the bar and utilize new, emerging technologies and applications to achieve organizational successes. From non-profits and coalitions, to Fortune 500 companies and countries around the world, Jason knows how to bridge a client's business/mission objectives to ensure the solution delivers the required results. I have learned a lot from working along side of Jason and look forward to hearing about his continued successes! See less"
      }
    ],
    "received": [
      {
        "user": "https://www.linkedin.com/in/charlotte-talis/",
        "text": "\n        As co-founder of Bluetext I have interviewed, hired, and collaborated with 100s of talented people.  Charlotte is a shining star in that pack of supreme talent.\n\nI directly managed Charlotte for more then a year and I can proudly say she has grown, matured and is an amazing asset to any organization she joins.\n\nCharlotte grew as a great designer in my time working with her.   Growing from a stable production support role to a great lead designer.  She took on design lead roles for leading organizations like E.Cohen and Veeder Root.\n\nBesides being a solid design teammate.  Charlotte is a natural leader.  Charlotte took on leadership roles with our creative group supporting all resourcing and utilization activities.  Spanning weekly resourcing, daily standups, and strategically reviewing resourcing in both macro and micro views.\n\nIt was a pleasure working with Charlotte, and hope to work with her again someday.\n\nJason Siegel, Co-Founder\nChief Creative Officer, Chief Digital Officer, CMO\nBluetext\n\n... See more\n\n  "
      },
      {
        "user": "https://www.linkedin.com/in/david-schwinger-668b3978/",
        "text": "\n        If your going through a transaction, there is no better advisor, tax consultant, and rock solid lawyer then David.  His commitment to getting the deal done, working around the clock, and making himself available to us 24x7.  I recommend David more then words can describe!\n\n... See more\n\n  "
      }
    ]
  },
  "accomplishments": [
    {
      "count": "1",
      "items": [
        "Spanish"
      ]
    },
    {
      "count": "1",
      "items": [
        "YPO (Young Presidents' Organization"
      ]
    },
    {
      "count": "1",
      "items": [
        "Alcatel-Lucent Digital Platform"
      ]
    }
  ],
  "peopleAlsoViewed": [
    {
      "user": "https://www.linkedin.com/in/ricksilipigni/",
      "text": "Managing Partner | Chief Growth Officer at Bluetext"
    },
    {
      "user": "https://www.linkedin.com/in/michael-adolph-334066b/",
      "text": "Senior Partner & Creative Director"
    },
    {
      "user": "https://www.linkedin.com/in/don-goldberg-5b12986/",
      "text": "Co-Founder and Partner at Bluetext"
    },
    {
      "user": "https://www.linkedin.com/in/garygarth/",
      "text": "Co-Founder & Head of Strategic Partnerships - Helping agencies explore new revenue streams and maximize profitability"
    },
    {
      "user": "https://www.linkedin.com/in/eric-foster-7a94548b/",
      "text": "Captain at Monterey Bay Sailing"
    },
    {
      "user": "https://www.linkedin.com/in/ann-vogel/",
      "text": "Managing Director | Head of Global Brand Strategy"
    },
    {
      "user": "https://www.linkedin.com/in/timgentry/",
      "text": "Global Contributor - Lifelong Student - Servant Leader"
    },
    {
      "user": "https://www.linkedin.com/in/jeniferkern/",
      "text": "Tech Growth CMO"
    },
    {
      "user": "https://www.linkedin.com/in/lisa-feit-1073015/",
      "text": "Producer/Writer at National Geographic Television, Global Production Services"
    },
    {
      "user": "https://www.linkedin.com/in/faithburt/",
      "text": "Senior UX Designer"
    }
  ],
  "volunteerExperience": [
    {
      "title": "Lecturer",
      "experience": "American Marketing Association",
      "description": "Education",
      "date2": "Cause"
    }
  ]
}