{
  "profile": {
    "name": "Michael Pirone ",
    "headline": "SaaS/Tech Sales Recruiter at CloserIQ",
    "location": "New York, New York",
    "connections": "500+"
  },
  "positions": [
    {
      "title": "CloserIQ",
      "description": "Founded in 2014, CloserIQ has quickly become the leading sales recruiting firm in NYC. Using proprietary matchmaking algorithms, our tech-enabled recruiters have scaled 300+ of the most disruptive startups in recent years.\n... ",
      "date1": "Apr 2019 – Present",
      "date2": "1 mo",
      "roles": [
        {
          "title": "Strategic Talent Advisor",
          "date1": "Apr 2019 – Present",
          "date2": "1 mo"
        },
        {
          "title": "Senior Talent Advisor",
          "date1": "Jan 2018 – Mar 2019",
          "date2": "1 yr 3 mos"
        }
      ]
    },
    {
      "title": "Senior Development Officer",
      "companyName": "Georgetown Preparatory School",
      "date1": "Apr 2017 – Jan 2018",
      "date2": "10 mos"
    },
    {
      "title": "Advisory Consultant",
      "companyName": "Deloitte",
      "date1": "Sep 2014 – Dec 2016",
      "date2": "2 yrs 4 mos"
    }
  ],
  "educations": [
    {
      "title": "University of Denver - Daniels College of Business",
      "degree": "BSBA"
    }
  ],
  "skills": [
    {
      "title": "Recruiting",
      "count": "8"
    },
    {
      "title": "Start-ups",
      "count": "7"
    },
    {
      "title": "Sales",
      "count": "6"
    }
  ],
  "recommendations": {
    "givenCount": "4",
    "receivedCount": "6",
    "given": [
      {
        "user": "https://www.linkedin.com/in/josh-blank-462b142a/",
        "text": "Mike was a tremendous asset in helping me find my next role in sales. Thorough, consultative with excellent follow-up and communication skills, Mike made a process that can seem challenging and inundating feel simple and easy. I would highly recommend working with Mike."
      },
      {
        "user": "https://www.linkedin.com/in/michael-williams-a0239b13/",
        "text": "Mike went out of his way — basically overnight — to create and qualify a few really solid opportunities for me. His sense of urgency, coupled with a thoughtful, client first approach, was a breath of fresh air. I’d happily recommend him as a trusted partner and look forward to having him on my side in the future."
      },
      {
        "user": "https://www.linkedin.com/in/keithkandora/",
        "text": "Working with Mike was an amazing experience. Not only did he help me find my new position, he also helped me with the planning of my career. I truly thank him for going above and beyond with everything that he did for me. I’d work with him again in a heartbeat."
      },
      {
        "user": "https://www.linkedin.com/in/sarahhoskin/",
        "text": "Mike worked to find the right position for me at a particularly stressful time. With about a month until graduation, he responded to my urgency by setting up multiple opportunities that matched my interests within a few days of our first conversation. The entire process took about two weeks! During this time, Mike was an invaluable resource in helping me interview prep, always being able to answer any questions I had (at any time of day), and work through the stress of choosing the right position for me. I ended up accepting my first full-time role at Fundera before graduation, making my transition into the real-world seamless. Couldn't thank you enough, Mike! See less"
      },
      {
        "user": "https://www.linkedin.com/in/kate-brennan-664a0989/",
        "text": "After working with countless recruiters across the tech, medical, and sports sales industries, I had given up on believing that recruiters were working for me, and not their own commission checks. Mike changed that.\n\nMike made it his mission to make sure that my next move was exactly what I wanted, and needed. He really took the time to understand my career vision, and helped formulate the action plan on how to get there. The job search process, especially in sales, is increasingly difficult, and Mikes consistent, positive, and strategic attitude kept me motivated to move forward. I felt like he was committed just as much (if not more) than I was, to finding the perfect role. What I loved most about working with mike, was that it was a partnership. When I turned down lucrative offers because ‘I wasn’t feeling it’, he helped me navigate my conflicting emotions, and steered me back towards my goals. I never felt pressured, or coerced, because Mike exposed me to so many opportunities; he made it easy to take my time and make the choice that was right for me... I am eternally grateful for his help and guidance, and couldn’t recommend him more to candidates, and anyone looking to work with him. Do not hesitate to reach out to me if there’s any other information I can provide. I would love the opportunity to share more about how wonderful he is. See less"
      },
      {
        "user": "https://www.linkedin.com/in/david-khudashvili-071770147/",
        "text": "Michael was an incredible resource for helping me find a role in software sales. I can't emphasize enough his professionalism, courtesy, and diligence to ensure that I was paired with a role that I could see myself doing long term. Every conversation we had was paired with insight, strategic guidance, and tons of humor to make my life and experience easier. One notable thing I always have in mind about working with Mike is how he ALWAYS made sure that the role was exactly what I wanted and did everything in his power to speed up the process of securing it. After 2 months of hard work, we secured an incredible opportunity. Glad to gain a professional resource and a friend. No other recruiters come close. Go with Mike, he's your guy! See less"
      }
    ],
    "received": [
      {
        "user": "https://www.linkedin.com/in/xander-cannon-a3a36659/",
        "text": "\n        It was a pleasure working with Xander as he secured his position at Anvyl. From our first call, he knew exactly what he was looking for in his career, was diligent in his research, and we were able to work together in a collaborative way to find the right opportunity for him. Xander is a natural leader, and his in-depth knowledge of sales and startups, coupled with his drive and work ethic, are going to take him far in his career. Most importantly, Xander is a class act and I'm looking forward to continuing working him in the future.\n\n... See more\n\n  "
      },
      {
        "user": "https://www.linkedin.com/in/pete-brereton/",
        "text": "\n        It was a privilege to be able to work with Pete in helping him secure his position at Chainalysis. Pete has extensive knowledge of sales and startups, a work ethic that is second to none, and, above all, is a great human being who will be an asset to any team that he is on.\n\n... See more\n\n  "
      }
    ]
  },
  "accomplishments": [
    {
      "count": "2",
      "items": [
        "English",
        "Spanish"
      ]
    }
  ],
  "peopleAlsoViewed": [
    {
      "user": "https://www.linkedin.com/in/maddiegaither/",
      "text": "Recruiter at Google"
    },
    {
      "user": "https://www.linkedin.com/in/jasonlalk/",
      "text": "Director of Sales at CloserIQ -- I'm hiring!"
    },
    {
      "user": "https://www.linkedin.com/in/josephcori/",
      "text": "Strategic Talent Advisor at CloserIQ"
    },
    {
      "user": "https://www.linkedin.com/in/sam-lawson-johnston-b594aa85/",
      "text": "SaaS/Tech Sales Recruiter at CloserIQ - We're Hiring!"
    },
    {
      "user": "https://www.linkedin.com/in/matt-bowman-83a981b5/",
      "text": "Strategic Client Advisor at CloserIQ"
    },
    {
      "user": "https://www.linkedin.com/in/nadia-gonzales-prada/",
      "text": "Senior Talent Advisor at CloserIQ"
    },
    {
      "user": "https://www.linkedin.com/in/cgrosek/",
      "text": "Manager at CloserIQ - We're Hiring!"
    },
    {
      "user": "https://www.linkedin.com/in/roxana-mead-7211bb75/",
      "text": "Senior Manager at CloserIQ"
    },
    {
      "user": "https://www.linkedin.com/in/cassie-yettru-18b9a466/",
      "text": "Manager @CloserIQ - I'm Hiring!"
    },
    {
      "user": "https://www.linkedin.com/in/naomielenawalker/",
      "text": "Client Advisor at CloserIQ"
    }
  ],
  "volunteerExperience": [
    {
      "title": "Volunteer",
      "experience": "SOME (So Others Might Eat)",
      "description": "Poverty Alleviation",
      "date1": "2005 – 2010",
      "date2": "5 yrs"
    },
    {
      "title": "Volunteer",
      "experience": "KEEN (Kids Enjoy Exercise Now)",
      "description": "Children",
      "date1": "2008 – 2009",
      "date2": "1 yr"
    },
    {
      "title": "Volunteer",
      "experience": "Habitat for Humanity International",
      "date1": "Oct 2015 – Present",
      "date2": "3 yrs 7 mos"
    }
  ]
}